<pad>
<unk>
<sos>
<eos>
!
$
%
'
''
'd
'll
'm
're
's
've
,
.
0
1
1,000
1,600
10
10,000
10.00
100
100,000
100-meter
105
10:30
10th
11
119
11:00
12
12:30
13-year
15
155
16
1603
1636
165
1650
16th
1789
18
180
1865
1876
1880
1888
1899
1914
1927
1930
1939
1941
1945
1947
1950
1970
1972
1978
1988
1989
1996
2
2,000
20
2003
2008
2009
2010
2013
2015
2020
20th
21st
25
25th
26
28th
2:30
3
3,000
3.00
3.4
30
305
31st
32
3:00
3:30
3rd
40
40,000
400
455
4:10
5
5,000
50
50,000
500
52nd
56
58
6
6,000
600
65
6:00
6:30
7
70
7:00
7:30
7:45
7th
8
800,000
839
88
8:30
9
98
9:00
?
A
AC
AI
AIDS
ASAP
About
Above
Abraham
Absence
Absolutely
Academic
Accidents
According
Accuracy
Acid
Actinium
Action
Actions
Actually
Admission
Advertisements
Afraid
Africa
After
Agriculture
Air
Airlines
Airport
Alcohol
Alexander
Algebra
Alice
All
Allies
Allow
Almost
Alps
Although
Always
Am
Amazon
America
American
Americans
An
And
Android
André-Louis
Angeles
Animals
Another
Answer
Antarctic
Any
Anybody
Anyone
Anything
Apart
Apparently
Apples
Approximately
April
Arab
Arabia
Arabic
Arctic
Are
Arithmetic
Arizona
Arlington
Armenia
Armenian
Army
Arrangements
Artificial
As
Asia
Asian
Asians
Ask
Astronomy
At
Atlantic
Auckland
August
Australia
Australians
Austria
Automobiles
Avenue
Awesome
B
Babylon
Back
Baikal
Bali
Balls
Banks
Barbecuing
Basque
Bay
Be
Bears
Beauty
Because
Bee
Beer
Beethoven
Before
Beginners
Behave
Beijing
Being
Believe
Bell
Besides
Best
Better
Between
Beware
Bible
Big
Birch
Birds
Birmingham
Biting
Biwa
Björk
Black
Blenders
Blondes
Blow
Boil
Boston
Both
Boys
Brasilia
Brazil
Bread
Break
Breakfast
Breathe
Bridge
Bring
Britain
British
Broccoli
Brown
Brush
Buddha
Buddhism
Burn
Bush
But
Butter
Buy
By
C
C++
CD
CDs
CEO
CIA
CV
Ca
California
Call
Calm
Calvin
Cambridge
Can
Canada
Canadian
Canadians
Canberra
Cancer
Car
Carmel
Carrots
Carry
Cash
Catch
Cats
Celsius
Cemetery
Centauri
Centigrade
Central
Certainly
Champagne
Change
Chapter
Charles
Chaucer
Check
Cheers
Cheese
Cherry
Chiba
Chicago
Children
China
Chinese
Chinese-style
Chocolate
Choose
Christ
Christmas
Cities
City
Civil
Class
Classes
Claus
Clean
Clearly
Clint
Close
Clothes
Coal
Coast
Coffee
Cold
Collect
Colombian
Colorado
Columbus
Comb
Come
Coming
Compare
Compared
Compass
Complaining
Computers
Congratulations
Constant
Constitution
Continent
Continue
Control
Cool
Coolidge
Cosmetic
Could
Count
Cover
Cows
Crater
Creationism
Cross
Cup
Curie
Customs
Cut
Cutting
DJ
DNA
Dad
Daddy
Dallas
Dark
Day
Days
Deal
Dear
Death
Debierne
December
Declarations
Delete
Demand
Democracy
Denmark
Depression
Despite
Destroy
Detroit
Developing
Did
Diet
Dinner
Dinosaurs
Diplomats
Disney
Disneyland
Do
Doctors
Does
Dog
Dogs
Doing
Dome
Dozens
Dr.
Draw
Drink
Drive
Drivers
Driving
Drop
Drunk
Dry
Due
During
Dust
Dutch
Each
Earth
Earthquakes
Eastwood
Eat
Eating
Ebola
Edison
Edo
Education
Eggs
Eiffel
Eighty
Einstein
Electricity
Elephants
Elizabeth
Embassy
England
English
Englishman
Enjoy
Entering
Enthusiasm
Environmental
Equality
Esperanto
Europe
Europeans
Eve
Even
Ever
Everest
Every
Everybody
Everyone
Everything
Evidently
Examine
Except
Excess
Excuse
Exercise
Experience
Explain
Express
Facebook
Facts
Fahrenheit
Fancy
Fantastic
Farmers
Farsi
Fasten
Father
Fear
February
Feel
Few
Field
Fifth
Fight
Fill
Finally
Finland
Finnish
Fire
Firefox
First
Fish
Five
Flies
Florence
Flowers
Fluency
Flying
Follow
Food
Fools
For
Ford
Foreign
Foreigners
Forewarned
Forget
Forgotten
Fortunately
Fortune
Foster
Four
Foxes
France
Frankly
Freedom
French
Fresh
Friday
Friends
From
Fruit
Fruits
Fuji
Fur
GNP
Games
Generally
German
Germanic
Germans
Germany
Get
Getting
Ghosts
Ginza
Give
Go
God
Gogh
Going
Gold
Good
Goodbye
Goodbyes
Goodnight
Google
Got
Grab
Graham
Grammar
Grandpa
Great
Greece
Greek
Green
Greene
Greenland
Guess
Hachiko
Had
Hakodate
Half
Hamlet
Hand
Hands
Hang
Happiness
Happy
Harajuku
Harbor
Hard
Hardly
Harry
Harvard
Has
Hashimoto
Haste
Hastings
Have
Having
Hawaii
He
Health
Heights
Helen
Hello
Help
Hemingway
Hemisphere
Her
Here
Hey
Hi
Hide
Highway
Hilton
His
History
Hit
Hokkaido
Hold
Hollywood
Honda
Honesty
Hong
Hop
Hope
Horses
Hot
Hotel
House
How
However
Hug
Humans
Humor
Hundreds
Hunger
Hurry
I
I.D
IBM
ID
II
Iceland
Ideas
If
Ignore
Imagination
Immediately
Imports
In
India
Indian
Indigenous
Indo-European
Industry
Ingalls
Instead
Interest
International
Internet
Investigating
Iran
Iraq
Iron
Is
Islam
It
Italian
Italy
J.F
JST
Jacksons
January
Japan
Japanese
Jazz
Jealousy
Jesus
John
Judging
Juliet
July
June
Jupiter
Just
Justice
Kanto
Karaoke
Keep
Keller
Kelly
Kennedy
Kentucky
Kill
Kindness
King
Kingdom
Kiss
Kissing
Knopfler
Knowledge
Kobe
Kong
Korea
Korean
Kyoto
Ladies
Lake
Language
Languages
Large
Laser
Last
Later
Latin
Laura
Lawyers
Learning
Leave
Leaves
Lemons
Lend
Lesson
Let
Liars
Lie
Life
Lighten
Like
Lincoln
Lindbergh
Lips
Listen
Liszt
Liz
Lock
London
Lonely
Long
Look
Looking
Looks
Los
Lots
Louder
Louvre
Love
Luckily
Lunch
Lying
MP3
Make
Making
Malaysia
Man
Mandarin
Manholes
Many
March
Marie
Mark
Marriage
Married
Mars
Mary
Mass
Mastering
Maternal
Math
Mathematics
Matsue
May
Maybe
Me
Meet
Melbourne
Mercury
Merry
Mexican
Mexico
Might
Milk
Millions
Milton
Mind
Minister
Mission
Mix
Moderate
Mom
Monday
Mondays
Money
Monopoly
More
Most
Mother
Move
Movie
Mozart
Mr
Mt
Much
Museum
Mutual
My
NTT
Nagoya
National
Nations
Nature
Nearly
Needless
Neither
Neptune
Nevada
Never
New
News
Next
Nice
No
No.3
Nobel
Nobody
None
Northern
Not
Nothing
Now
Nowadays
OK
Obey
Obviously
Ocean
October
Of
Ogai
Oh
Oil
Old
Olympic
Olympics
On
Once
One
Onions
Only
Open
Opinion
Optimists
Orange
Orchestra
Osaka
Oscar
Ostriches
Otaru
Other
Others
Otherwise
Ouch
Our
Out
Outside
Over-sleeping
Owing
Oxford
PKO
PTA
Pacific
Paper
Pardon
Parents
Paris
Park
Parliament
Part
Pass
Patience
Pay
Peace
Pearl
People
Perfect
Perhaps
Permit
Perseverance
Persian
Philippines
Philosophy
Phoenix
Physics
Pick
Pigs
Pilots
Pizza
Place
Plastic
Plastics
Play
Playing
Please
Pluto
Poland
Police
Poor
Popcorn
Pork
Portugal
Possibly
Potter
Pour
President
Prices
Pride
Prime
Prince
Printing
Probably
Problems
Production
Professional
Promises
Proxima
Publication
Pull
Put
Putting
Quality
Queen
Quit
Quite
Rabbits
Rain
Rainbow
Raise
Raspberries
Rather
Read
Reading
Reagan
Real
Really
Recently
Red
Red-haired
Refugees
Release
Remember
Repairs
Research
Respect
Restart
Revolution
Rhine
Rice
Riding
Right
Robots
Roll
Rome
Romeo
Room
Run
Running
Russell
Russia
Russian
Ryūtarō
SSH
Safety
Sahara
Sales
Salmon
Salt
Santa
Saturday
Saturdays
Saturn
Saudi
Save
Say
Scary
School
Science
Scientists
Scotch
Scotland
Sea
Second
See
Seeing
Seen
Seine
Selling
Send
Sendai
Sensing
Sentences
September
Several
Sewage
Shake
Shakespeare
Shall
Shame
Shanghai
She
Sheep
Sheldon
Shibuya
Shiga
Shine
Short
Shortly
Should
Shouting
Show
Shut
Sidney
Since
Sing
Singapore
Singing
Sir
Sit
Six
Sixteen
Skating
Skip
Slavery
Slavic
Slight
Slow
Smiles
Smith
Smoke
Smoking
Snow
So
Soccer
Social
Sociopaths
Solar
Soldiers
Some
Somebody
Someday
Someone
Something
Sometimes
Sooner
Sorry
South
Soviet
Spanish
Speak
Speaking
Speech
Spell
Sport
Sports
Spring
Square
Stadium
Stand
Standard
Stars
Start
Starting
States
Station
Stay
Step
Stick
Stir
Stock
Stockholm
Stop
Strange
Strawberries
Street
Strictly
Strike
Students
Study
Studying
Stuff
Subtract
Such
Suddenly
Summer
Sumo
Sun
Sunday
Sundays
Suppose
Suruga
Sweden
Swedish
Sweet
Swimming
Swiss
Switzerland
Sydney
Symphony
System
T-shirt
T-shirts
T.V
TV
Takako
Takasu
Take
Taking
Takoyaki
Talk
Talking
Tangerines
Taxi
Teachers
Teaching
Tears
Tell
Ten
Tennis
Teresa
Termites
Terrific
Tetris
Texas
Texting
Thai
Thames
Thank
Thanks
That
The
Their
Then
There
These
They
Things
Think
This
Those
Though
Thousands
Three
Throughout
Throw
Thursday
Tickets
Tidy
Tigers
Time
To
Today
Tofu
Tokyo
Tom
Tommy
Tomorrow
Tottori
Towada
Tower
Toyota
Traffic
Training
Translate
Translating
Travel
Trees
Trim
True
Trust
Truth
Try
Tsunamis
Tuesday
Tulips
Turn
Turtles
Twitter
Two
U.N
U.S.
UFO
UFOs
UK
UN
US
USA
Ultraviolet
Umbrellas
Unbelievable
Uncle
Unfortunately
Union
United
University
Usually
Valentine
Valuable
Van
Venice
Very
Vienna
Vietnam
Visiting
Visitors
Volcanic
Volleyball
Vote
Waikiki
Wait
Waiter
Waitress
Wake
Walk
Waltz
Wan
War
Warsaw
Was
Wash
Washington
Waste
Watch
Watching
Water
Waterloo
We
Wealth
Weather
Wednesday
Weeds
Welcome
Well
Were
West
Wet
What
Whatever
When
Where
Wherever
Whether
Which
While
White
Who
Whoever
Whose
Why
Wi-Fi
Wild
Will
William
Wine
Winners
Winter
Wipe
Wires
With
Without
Wo
Wolves
Women
Wonderful
Wood
Words
Work
World
Would
Write
Year
Years
Yes
Yesterday
York
You
YouTube
Young
Your
Yukawa
Zealand
Zero
``
a
a.m
a.m.
abandoned
abated
abbreviation
abducted
abilities
ability
ablaze
able
abnormal
aboard
about
above
abroad
absence
absent
absolute
absolutely
absorbed
absorbs
abstain
abstract
absurd
abundant
abused
accelerated
accept
accepted
access
accessible
accident
accidental
accidentally
accidents
accommodate
accompanied
accompanies
accompany
accomplish
accomplished
according
account
accumulated
accurate
accurately
accused
accusing
accustomed
ache
aches
achieve
achieved
achievement
aching
acid
acknowledged
acorns
acquaintance
acquaintances
acquainted
acquire
acquired
acquitted
acres
across
act
acted
acting
action
active
activities
activity
actor
actress
acts
actually
add
added
addict
adding
addition
address
addressed
adequate
adjoins
adjust
admire
admired
admires
admiring
admission
admit
admitted
adopt
adopted
adorable
adores
adult
adults
advance
advances
advantage
adventure
adventures
advertised
advertisements
advertising
advice
advise
advised
advocate
aerobics
affair
affairs
affect
affected
affection
affects
afford
afraid
after
afternoon
afternoons
afterwards
again
against
age
aged
agencies
agency
agenda
agent
ages
aggressive
aging
ago
agree
agreeable
agreed
agreeing
agreement
agrees
agriculture
ahead
aim
aimed
air
airmail
airplane
airplanes
airport
aisle
alarm
alarmed
album
alcohol
alert
aliens
alike
alive
all
all-day
allegiance
allergic
alley
allied
allow
allowed
ally
almost
alone
along
alphabet
already
also
although
altogether
always
am
amassed
amateur
amazed
amazing
ambassador
ambiguities
ambiguous
ambition
ambitions
ambulance
ambulances
amends
ammonia
among
amount
amounted
ample
amplifier
amusing
an
analyzed
ancient
and
angel
angels
anger
angle
angles
angry
animal
animals
ankle
announce
announced
annoy
annoyed
annoying
anonymous
another
answer
answered
answering
answers
antenna
anticipate
antique
antiques
anxious
any
anybody
anymore
anyone
anything
anytime
anyway
anywhere
apart
apartment
apologies
apologize
apologized
apology
apostrophe
app
apparently
appeal
appear
appearance
appearances
appeared
appears
appetite
apple
apples
applicable
applicants
application
applications
applied
apply
appoint
appointed
appointment
appreciate
appreciates
approach
approaching
approval
approve
approved
apron
apt
archer
architect
architecture
archive
are
area
areas
argue
argued
arguing
argument
arisen
arithmetic
arm
armchair
armed
arms
army
around
arrange
arrest
arrested
arrests
arrival
arrive
arrived
arrives
arriving
arrogance
arrogant
arrow
art
article
articles
artificial
artist
artistic
artists
as
ash
ashamed
ashes
ashtray
aside
ask
asked
asking
asleep
asparagus
aspect
aspects
asphalt
aspired
aspirin
assembled
assess
assets
assigned
assistance
assistant
associate
association
assumption
asthma
astonish
astonished
astonishment
astrology
astronaut
astrophysicist
at
ate
atheist
atmosphere
atomic
atrocious
attach
attached
attack
attacked
attempt
attempted
attempts
attend
attended
attention
attic
attitude
attracted
attraction
attractive
attributed
audacity
audience
aunt
author
authority
authorized
autistic
autobiography
autograph
automobile
automobiles
autumn
available
average
avoid
avoidable
avoids
awake
aware
awareness
away
awesome
awful
awfully
awkward
babbling
babies
baby
bachelor
back
backed
background
backward
bad
bad-looking
badly
bag
baggage
bags
bait
baked
bakery
baking
balance
balanced
balcony
bald
ball
balloon
ballpark
ballpoint
baloney
bamboo
ban
banana
bananas
band
bandage
banged
bank
bankrupt
banks
barbecue
barbeque
barber
bare
barefooted
barely
bargain
bargaining
bark
barked
barking
barley
barometer
bars
base
baseball
based
basement
basic
basis
basket
basketball
bat
bath
bathe
bathed
bathroom
bathtub
battered
batteries
battle
be
beach
beans
bear
beard
bears
beasts
beat
beating
beautiful
beautifully
beauty
became
because
beckoned
become
becomes
becoming
bed
bedroom
bedrooms
beds
bedtime
bee
beef
been
beer
beers
bees
before
beforehand
beg
began
beggar
begged
begging
begin
beginner
beginning
beginnings
begins
begun
behave
behaved
behaves
behavior
behind
beholder
being
beings
belief
beliefs
believe
believed
believes
bell
belly
belong
belonged
belongs
below
belt
belts
bench
bend
bending
beside
besides
best
bet
betray
betrays
better
between
beverage
bewitched
beyond
bicycle
bid
big
bigger
biggest
bike
bill
billion
billionaire
billions
biologist
biology
bird
birds
birth
birthday
bit
bite
bites
biting
bits
bitten
bitterly
bitterness
bizarre
black
blackberries
blackbird
blackbirds
blackboard
blame
blamed
blanket
blankets
blast
bleach
bleed
bleeding
bless
blessed
blessing
blew
blind
blinded
blinds
blink
blisters
blizzard
block
blocked
blocks
blog
blonde
blood
bloom
blooming
blossoms
blouse
blowing
blown
blue
blueberries
blueberry
bluest
bluntly
blushed
blushing
board
boarded
boarding
boasts
boat
boats
bodily
body
bodyguard
boil
boiled
boiling
boils
bomb
bombed
bombs
bones
book
bookcase
booked
bookkeeping
booklet
books
bookstore
bookworm
boom
booth
boots
border
borders
bored
boring
born
borrow
borrowed
boss
both
bother
bothered
bothering
bottle
bottles
bottom
bought
bounce
bounced
bound
bow
bowl
bowling
bowls
box
boxes
boxing
boy
boyfriend
boys
brain
brains
brakes
branch
brass
brave
bread
break
breakfast
breaking
breast-feeding
breath
breathe
breathed
breathing
bribes
bride
bridge
briefcase
briefly
bright
brighter
brightly
brilliant
bring
brings
broad
broadcast
broccoli
brochure
broke
broken
brooch
brook
broom
brother
brothers
brought
brown
browser
brush
brushed
brushing
bucket
bud
buddy
budget
buffaloes
buffet
bug
bugs
build
building
buildings
built
bulb
bulky
bullet
bulletproof
bullied
bumped
bunch
buoy
burglar
burial
buried
burn
burned
burning
burns
burnt
burst
bus
buses
bush
bushes
busier
business
businessmen
busy
but
butter
butterfly
button
buy
buying
buys
by
ca
cab
cabin
cabinet
cafeteria
cage
caged
cake
cakes
calculated
calculation
calculator
calendar
calibrated
call
called
caller
calling
calls
calm
calmed
came
camera
cameras
camp
campfire
camping
campus
can
canal
cancel
canceled
cancelled
cancer
candle
candlelight
candles
candy
canoe
cap
capable
capacity
capital
capitals
captain
captivate
captive
captivity
capture
captured
car
carbohydrates
carbonated
card
cardboard
cards
care
cared
careful
carefully
careless
carelessly
carelessness
cares
carp
carpenter
carpentry
carpet
carried
carries
carrots
carry
carrying
cars
cart
cartridge
carved
case
cases
cash
cashier
cassette
castle
castles
cat
catch
catches
cats
cattle
caucasian
caught
cause
caused
causes
causing
cautiously
cave
ceiling
celebrate
celebrations
celebrity
cell
cellphone
cellular
censured
cent
center
centimeters
central
cents
century
ceremonies
ceremony
certain
certainly
chair
chairman
chairperson
chairs
challenge
champion
championship
chance
chances
change
changed
changes
changing
chapped
character
characteristic
characteristics
characters
charge
charisma
charity
charm
charming
chased
chasing
chat
cheap
cheaper
cheapest
cheat
cheated
cheating
check
check-in
checked
checking
checkout
checks
cheek
cheeks
cheer
cheered
cheerful
cheese
chef
chemical
chemistry
cherries
cherry
chess
chest
chew
chewed
chewing
chicken
chief
child
childhood
childish
childishly
childlike
children
chimed
chimney
chip
chipped
chips
chit-chat
chocolate
chocolates
choice
choices
choked
cholera
cholesterol
choose
chopsticks
chose
chosen
church
cigar
cigarette
cigarettes
circle
circus
cities
citizens
city
civil
claim
claims
clapped
clarification
clarifying
class
classes
classical
classless
classmate
classmates
classroom
clean
cleaned
cleaner
cleaners
cleaning
cleansed
clear
cleared
clearly
clears
clenched
clerk
clever
clicked
cliff
climate
climates
climb
climbed
climbing
clinic
clock
close
closed
closely
closer
closes
closest
closet
closing
cloth
clothes
clothing
cloud
clouds
cloudy
clown
club
clubs
clueless
clues
cluttered
coach
coal
coast
coat
coated
coats
cockroaches
coffee
coin
coincide
coincidence
coincides
coins
coke
cola
cold
coldest
colds
collapsed
collect
collected
collecting
collection
college
colony
color
colors
coma
combat
combination
come
comedian
comes
comfort
comfortable
comforted
comic
comics
coming
command
commanded
comment
comments
commerce
commission
commit
committed
committee
common
communicate
communicated
community
commute
compact
companies
company
compare
compared
comparison
compartment
compass
competed
competent
competitions
competitive
compiling
complain
complained
complaining
complains
complaints
complete
completed
completely
complex
complicated
compliment
composition
comprehend
compromise
compute
computer
computers
concentrate
concept
concern
concerned
concerns
concert
concerts
concise
concluded
conclusion
concrete
condition
conditioner
conditioning
conditions
conduct
conference
confess
confessed
confidence
confident
confidential
confidentially
confined
confirmed
conflict
conform
confronted
confuse
confused
congratulated
congratulations
congressional
connect
connection
conscience
conscious
consecutive
consent
consented
consequences
conservationists
conservative
consider
considerable
considerate
consideration
considered
considering
consists
constantly
construct
constructed
construction
consult
consume
consumers
consumes
consumption
contact
contacted
contagious
contain
contains
contemporary
content
contented
contest
context
continent
continue
continued
continuing
contract
contrary
contributed
control
controversial
conveniences
convenient
conveniently
conventional
conversation
conversationalist
convey
convince
convinced
cook
cooked
cookies
cooking
cool
coolest
cooperation
cooperative
cope
copies
copy
coral
cord
corn
corner
cornered
corners
correct
corrected
corrupt
cost
costs
cottage
cottages
cotton
couch
cough
coughing
could
count
counted
counter
counting
countries
country
countrymen
countryside
counts
couple
courage
courageous
course
court
cousin
cousins
cover
covered
cow
coward
cowardly
coworkers
coyote
cradle
craftsman
cramming
cramped
cranes
crash
crashed
crazy
cream
created
creature
credibility
credit
creepy
crept
cricket
cried
cries
crime
crimes
criminal
crisis
critical
criticized
criticizing
crops
cross
cross-country
crossed
crossing
crow
crowd
crowded
crown
crucial
cruel
crush
crushed
crutches
cry
crying
cub
cube
cubed
cultural
culture
cup
cupboard
cupcakes
cups
cure
cured
curious
current
currently
curry
curtain
curtains
cuss
customer
customers
customs
cut
cute
cuter
cutest
cuts
cutting
cycle
cycling
cynical
dad
daily
dam
damage
damaged
damages
damp
dance
dancer
dancing
danger
dangerous
dare
dark
darker
darkness
dash
dashboard
data
date
dates
dating
daughter
daughters
dawn
day
daydreaming
days
dead
dead-end
deadline
deadlock
deadly
deaf
deal
dealing
deals
dealt
death
deaths
debate
debt
decay
deceitful
deceive
deceived
decency
decent
decide
decided
decides
deciding
decision
decisions
declare
declared
decline
declined
decrease
decreased
decreasing
dedicated
dedication
deed
deeds
deep
deepest
deeply
deer
defeated
defeatist
defective
defects
defended
defibrillator
defined
definite
definitely
degree
degrees
deity
delay
delayed
delays
delete
deleted
deli
delicious
delighted
delightful
deliver
demand
demanded
demands
democracy
demonstrate
demonstrated
demonstration
denied
denies
density
dentist
dentists
deny
denying
deodorant
department
departure
depend
depended
dependent
depends
deposit
deposited
depressing
depression
deprived
depth
deputy
describe
described
description
desert
deserve
deserves
design
designed
designer
desirable
desire
desired
desires
desk
desks
desktop
desperate
despise
despised
dessert
destination
destinies
destiny
destroyed
detail
detailed
details
detective
detectives
determination
determine
determined
devastating
develop
developed
developing
development
develops
device
devil
devoted
devoured
diabetes
diabetic
dial
dialects
dialed
dialog
diamond
diamonds
diary
dictionaries
dictionary
did
die
died
diet
dieting
differ
difference
differences
different
differently
difficult
difficulties
difficulty
dig
digestion
digging
digital
dignified
dignity
dim
dining
dinner
dinnertime
diplomacy
diplomat
diplomatic
dipped
direct
direction
directions
directly
director
dirt
dirty
disable
disadvantage
disadvantages
disagree
disagreeable
disappearance
disappeared
disappoint
disappointed
disassembled
disaster
disasters
disc
discarded
disclosed
discount
discover
discovered
discoveries
discovery
discriminate
discrimination
discs
discuss
discussed
discussing
discussion
disease
diseases
disguised
disgusted
dish
dishes
dislike
disliked
dismissed
disorder
display
displeased
disposal
disregarded
disrupted
distance
distances
distant
distinguish
distract
distressed
district
distrusted
disturb
disturbed
disturbing
dived
divide
divided
divides
divine
division
divorce
divorced
divorces
do
doctor
doctors
document
does
dog
doggy
doghouse
dogs
doing
doll
dollar
dollars
dolled
dolls
dolphin
donate
donates
donations
done
donor
donuts
door
doorbell
doors
dorm
double
doubled
doubling
doubt
doubtful
doubts
dove
doves
down
downs
downstairs
downtown
dozed
dozen
dozens
dragged
dragon
drama
drank
draw
drawer
drawers
drawing
dream
dreamed
dreaming
dreams
dreamt
drenched
dress
dressed
dresses
drew
dried
drink
drinking
drinks
dripping
drive
driven
driver
drivers
drives
driving
drop
dropped
drops
drove
drowned
drowning
drowsy
drug
drugs
drum
drunk
drunken
drunks
dry
dryer
ducked
due
dug
dumb
dummy
dump
dumped
during
dusk
dust
dusts
duties
duty
duty-free
dwells
dye
dyed
dying
e-mail
each
eager
ear
earlier
early
earn
earned
earns
earpiece
ears
earth
earthquake
earthquakes
ease
easier
easily
east
easy
easy-going
easygoing
eat
eaten
eater
eating
eats
eavesdropping
eclipse
ecological
ecology
economic
economical
economics
economy
edge
edible
educated
education
educational
effect
effective
effects
effort
efforts
egg
eggplant
eggs
eight
eight-hour
eight-thirty
eight-year-old
eighteen
eighth
eighty
eighty-one
either
elaborate
elated
elbowed
elbows
elderberry
elderly
elders
elected
election
elections
electric
electrical
electrician
electricity
elegant
elementary
elephant
elephants
elevator
elevators
eleven
eleventh
eligible
elliptical
eloquent
else
email
emails
embarrassed
embraced
emergency
emotion
emotional
emotions
emphasize
employed
employee
employees
employment
empty
encores
encountered
encouraged
encouragement
encourages
encouraging
encouragingly
end
endangered
endeavored
endeavour
ended
ending
ends
endure
enemies
enemy
energetic
energy
engaged
engagement
engine
engineer
engineering
engineers
engrossed
enjoy
enjoyed
enjoys
enough
ensures
enter
entered
entering
entertaining
enthusiasm
entire
entirely
entitled
entrance
envelope
envied
envious
environmental
envy
equal
equals
equator
equipment
equipped
equivalent
era
erased
ergonomic
eroded
err
errands
error
errors
erupted
escape
escaped
especially
essay
essays
essential
essentially
estimate
estimated
eternal
ethical
ethics
evacuated
evaporates
evasive
even
evening
event
ever
every
everybody
everyday
everyone
everything
everywhere
evidence
evident
evidently
evil
ex-husband
exact
exactly
exaggerate
exaggerated
exaggerating
exam
examination
examinations
examined
example
exams
exceed
exceeded
excellent
except
exception
exceptionally
exceptions
exchange
excited
exciting
excuse
excused
excuses
execute
executed
execution
executive
exercise
exercising
exhaust
exhausted
exhibition
exhibits
exist
existed
exit
expect
expectations
expected
expecting
expedition
expelled
expenses
expensive
experience
experiences
experiment
expert
experts
expired
explain
explained
explaining
explanation
explode
exploded
exploding
explorers
explosion
explosives
exports
express
expressed
expressing
exquisite
extend
extended
extends
extension
extent
external
extinct
extinction
extinguisher
extra
extracted
extraordinary
extravaganza
extreme
extremely
extremes
eye
eyeliner
eyes
eyesight
fabric
fabulous
face
faced
faces
facing
fact
factories
factory
facts
fail
failed
failure
fainted
fair
fairly
faith
faithful
fake
fall
fallen
falling
falls
false
fame
familiar
families
family
famished
famous
fan
fancy
fantasy
far
far-fetched
fare
fares
farewell
farm
farmer
farms
farsighted
fascinate
fascinated
fashion
fashions
fast
fast-food
fast-moving
faster
fastest
fat
fate
father
fatter
fault
faults
favor
favorable
favorite
fax
faxes
fear
feared
fearless
feathers
feature
fed
fee
feed
feeds
feel
feeling
feelings
feels
fees
feet
fell
fellow
felt
female
fence
festival
fever
feverish
few
fewer
fiction
field
fields
fifteen
fifth
fifty
fifty-fifty
fight
fighting
figure
figured
figures
file
fill
filled
film
final
finally
financial
financially
find
finding
finds
fine
finest
finger
fingernails
fingerprints
fingers
finish
finished
finishes
fire
fired
firemen
fireplace
fireworks
firm
firmly
first
first-aid
first-year
fish
fisherman
fishing
fishmonger
fist
fists
fit
fits
fitting
five
five-thirty
fix
fixed
fixing
flag
flame
flames
flammable
flash
flashlight
flat
flavoring
flawed
flea
fled
flew
flexibility
flies
flight
flights
float
floating
floats
flood
flooded
floor
floors
flour
flower
flowers
flowing
flows
flu
fluent
fluently
fluffy
fluids
fly
flying
focus
fog
foggy
folded
folder
folders
folding
folds
folks
follow
followed
following
follows
fond
fonder
food
foods
fool
fooled
fooling
foolish
foolproof
fools
foot
football
footprint
footprints
for
forbidden
force
forced
forces
forearmed
forecast
forehead
foreign
foreigner
foreigners
forest
forever
forgave
forget
forgetful
forgetting
forgive
forgiven
forgot
forgotten
fork
forks
form
formal
formed
former
forsake
forte
fortune
forty
forward
fossil
fought
found
foundation
founded
fountain
four
fourteen
fourth
fox
foxes
fragrance
fraud
freckles
free
freed
freedom
freeloaders
freeze
freezes
freezing
french
frequent
frequently
fresh
freshened
fridge
friend
friendly
friends
friendship
fries
fright
frighten
frightened
frightens
frog
frogs
from
front
frost
frowned
froze
frozen
fruit
fruits
fuel
full
fully
fumbled
fun
fundamental
funeral
funerals
funny
furious
furnished
furniture
further
fusion
fussy
future
gain
gained
gaining
gains
gallons
gamble
gambling
game
games
gang
garage
garbage
garbanzo
garden
gardener
gardening
garlic
gas
gases
gasoline
gate
gather
gathered
gathers
gave
gawking
gay
gazed
gender
gene
general
generally
generate
generation
generous
genetic
genius
gentle
gentleman
gentlemen
gently
genuine
geography
get
gets
getting
ghosts
gift
gifted
gifts
ginger
girl
girlfriend
girlfriends
girls
give
given
gives
giving
glad
gladly
glamorous
glanced
glass
glasses
glitters
globe
gloomy
gloves
glue
glued
go
goal
goals
goes
going
gold
golden
golf
golfer
gone
good
good-looking
goodbye
goodnight
goods
got
gotten
governed
government
governor
grabbed
graceful
gracious
grade
grades
graduate
graduated
grain
grammar
grammatical
grammatically
grand
grandchildren
grandfather
grandma
grandmother
granted
grape
grapes
grasp
grasped
grass
grateful
gratify
grave
graveyard
gravity
gravy
gray
great
greater
greatest
greedy
green
greenhouse
greet
greeted
grew
grinning
grip
groaned
ground
group
groups
grow
growing
growled
grown
grows
growth
grumpy
guarantee
guaranteed
guard
guarding
guess
guests
guide
guidebook
guilt
guilty
guitar
guitarist
gum
gums
gun
guns
guts
guy
guys
gym
habit
habits
hacked
had
haemorrhage
hail
hair
haircut
hairdressers
half
half-hearted
hall
hallway
hamburgers
hammer
hammered
hand
handbag
handball
handcuffs
handed
handing
handkerchief
handle
handled
handles
handling
handmade
hands
handsome
handwriting
handy
handyman
hang
hanging
happen
happened
happening
happens
happier
happiest
happily
happiness
happy
harbor
hard
hard-working
harder
hardest
hardly
hardwood
hare
harm
harmful
harmony
harvest
has
hat
hate
hated
hates
hating
hats
haunted
have
having
hawk
haystack
he
head
headache
headed
heading
headwords
health
healthiest
healthy
hear
heard
hearing
heart
heart-to-heart
heartless
heat
heated
heater
heating
heaven
heavier
heavily
heavy
heels
height
heights
held
helicopter
hello
helmet
help
helped
helpful
helping
helps
hemispheres
hemorrhage
hen
her
here
hero
heroes
heroine
heron
herons
herring
hers
herself
hesitate
hi
hiccup
hiccuping
hiccups
hid
hidden
hide
hiding
high
high-definition
high-pitched
high-tech
higher
highest
highly
highway
hike
hiking
hill
him
himself
hint
hinting
hire
hired
his
history
hit
hitched
hitchhiking
hitting
hoarse
hobbies
hobby
hockey
hold
holding
hole
holes
holiday
holidays
home
home-cooked
homeless
homeroom
homes
homesick
hometown
homework
honest
honesty
honey
honeymoon
honor
honorable
honors
hoodlums
hoofbeats
hook
hope
hoped
hopeful
hopeless
hopes
hoping
horizon
horizontal
hornets
horrible
horribly
horror
horse
horseback
horses
hospital
hospitality
hospitalized
hostess
hot
hotel
hotels
hotter
hottest
hour
hours
house
houses
housework
how
hug
huge
hugged
hugging
human
humanity
humble
humid
humiliate
humor
hunch
hundred
hundreds
hung
hunger
hungry
hunt
hunter
hunting
hurricane
hurried
hurriedly
hurry
hurt
hurting
hurts
husband
hypocritical
hypothesis
iPad
ice
icy
idea
ideal
ideas
identification
identified
idiot
idiots
idly
if
ignorance
ignorant
ignore
ignored
ignoring
ill
illegal
illegible
illness
illuminated
illusion
illustrated
imaginary
imagination
imaginative
imagine
imitated
imitation
immediately
immigrants
immune
impatient
imperative
implemented
implies
implying
impolite
import
importance
important
importation
imported
imports
imposing
impossible
impostor
impressed
impression
impressions
impressive
improper
improve
improved
improvement
improvements
improving
impulse
in
inappropriate
inattention
inch
inches
incident
include
included
includes
income
incompetent
inconsequential
inconvenience
incorrect
increase
increased
increasing
incredibly
indeed
independence
indicate
indicated
indicates
indifferent
indispensable
indistinguishable
indoors
industrial
industry
inevitable
infected
infirmary
inflation
inflexible
influence
influences
influential
inform
information
informative
informed
infrared
initials
injection
injure
injured
injury
ink
inkjet
inn
innocence
innocent
inquired
insane
insecure
inseparable
inside
insinuating
insisted
inspiration
install
instant
instantly
instead
instructor
instrument
instrumental
instruments
insufficient
insulted
insurance
insured
intelligence
intelligent
intend
intended
intent
intention
intentions
interest
interested
interesting
interfere
interfered
international
internet
internship
interpreted
interpreter
interrupt
interrupted
intersection
intervenes
interview
intimidate
intimidated
into
intoxicated
introduce
introduced
intrude
intruded
invaders
invaluable
invented
invention
invest
invested
investigate
investigating
investigation
investment
investments
investors
invisible
invitation
invite
invited
inviting
involuntary
involved
iron
ironed
ironing
irregular
irresistible
irresponsible
irritable
is
island
isolated
issue
issued
issues
it
itches
itchy
item
items
its
itself
jacket
jail
jam
janitor
jar
jazz
jealous
jealousy
jeans
jeep
jelly
jerk
jet
jewelry
jiffy
job
jobs
jogging
join
joined
joining
jointly
joints
joke
jokes
joking
journal
journalist
journey
joy
judge
judged
judgement
juice
jump
jumped
jungle
junior
junk
just
justifies
justify
kangaroos
karate
keen
keep
keeping
keeps
kept
key
keys
kick
kicked
kid
kidding
kidnapped
kidnapper
kids
kill
killed
killer
killing
kilogram
kilograms
kilometres
kimono
kind
kindly
kindness
kinds
king
kiss
kissed
kissing
kit
kitchen
kite
kites
kitten
knack
knee
knees
knew
knife
knight
knit
knitting
knives
knock
knocked
knocking
know
knowing
knowledge
known
knows
koala
lab
lack
lacking
lacks
lad
ladder
ladies
lady
laid
lake
lame
lamp
land
landed
landing
landlord
landmass
landslide
language
languages
laptop
large
largely
larger
largest
last
lasted
late
lately
later
latest
laugh
laughed
laughing
laughs
laughter
launched
laundry
law
lawn
lawyer
lawyers
lay
layout
laziest
laziness
lazy
lead
leader
leaders
leading
leads
leaf
league
leak
leaks
leaned
leaning
learn
learned
learning
lease
least
leather
leave
leaves
leaving
lecture
lecturer
lectures
led
left
left-handed
leftovers
leg
legal
legs
leisure
lemon
lend
lending
length
lens
lenses
lent
less
lesson
lessons
let
lets
letter
letters
letting
lettuce
level
liable
liar
liars
library
libras
license
licking
licorice
lid
lie
lied
lies
life
lifespan
lifetime
lift
lifted
light
lighter
lightning
lights
like
liked
likelihood
likely
likes
limit
limitations
limitless
line
lined
lines
lingering
lining
lion
lip
lips
liquid
liquor
list
listed
listen
listened
listening
listens
lit
literal
literally
literature
little
live
lived
lively
lives
living
loaded
loaf
loan
loans
loaves
lobes
lobster
locate
located
locating
location
lock
locked
locker
locking
log
logged
logic
logical
lonely
long
longer
longing
look
looked
looking
looks
lose
loser
loses
losing
loss
losses
lost
lot
lotion
lots
lottery
loud
louder
loudly
love
loved
lovely
lover
loves
loving
low
low-malt
lower
lubrication
luck
lucky
luggage
lulls
lunatic
lunch
lunchtime
lung
luxuries
lying
machine
machinery
machines
mad
made
madman
magazine
magazines
magician
magnetism
mahjong
mail
mailbox
mailed
mailing
mailman
main
mainly
maintain
major
majored
majority
majors
make
makes
makeup
making
male-dominated
malt
mammal
man
manage
managed
manager
mandatory
manner
manners
mansion
manual
manufacture
manufactures
manuscript
many
map
marathon
marches
marching
margarine
marine
market
marketable
marketing
marks
marriage
married
marry
marrying
marsh
marvels
mashed
mask
mass
massive
master
mastered
masterpiece
masters
mat
match
matches
material
materials
math
mathematical
mathematics
matter
matters
mattress
mature
may
maybe
mayo
mayonnaise
mayor
me
meadow
meal
meals
mean
meaning
meaningless
means
meant
measure
measured
measures
meat
mechanic
medical
medication
medications
medicine
medicines
meditate
meditation
meet
meeting
meetings
meets
melancholic
melon
melons
melt
melted
melts
member
members
membership
memories
memory
men
mend
mentally
mention
menu
meowed
mere
merely
mess
message
messages
met
metal
meters
meth
method
methodical
methods
mice
microphone
microscope
microwave
mid-July
mid-June
mid-forties
middle
middle-aged
midnight
might
migrating
mike
mild
mile
miles
military
milk
milkshake
millennia
miller
million
millionaire
mimic
mind
mine
mineral
minimum
miniskirt
minister
minute
minutes
miracle
mirror
miserly
mislaid
mislead
miss
missed
misses
missing
mission
mist
mistake
mistaken
mistakenly
mistakes
mistook
mistyped
misunderstand
misunderstanding
misunderstood
mix
mixed
mixture
mobile
model
modern
modest
modesty
modifications
mom
moment
money
mongrel
monk
monkey
monkeys
monopolies
monster
month
months
monumental
mood
moon
moon-viewing
moonlight
moons
more
morning
mornings
mortal
mosquito
mosquitoes
moss
most
mostly
motel
mother
motion
motive
motorbikes
motorcycle
mound
mountain
mountainous
mountains
mouse
mouth
mouthpiece
mouths
move
moved
moves
movie
movies
moving
much
mud
mugged
mule
mumps
murder
murdered
murderer
murmur
muscles
museum
museums
music
musical
musician
musicians
must
muttering
mutual
my
myself
mysteries
mysterious
n't
na
nail
nails
naive
naked
name
named
names
nap
napkin
napping
narrow
narrowly
nasty
nation
nations
native
nattō
natural
nature
navy
near
nearby
nearest
nearly
neat
necessarily
necessary
necessity
neck
necklace
nectarines
need
needed
needle
needles
needs
neglected
negotiation
neighbor
neighborhood
neighbors
neighbour
neither
nephew
nerve
nervous
nests
net
neutral
never
new
newcomer
newly-built
news
newspaper
newspaperman
newspapers
next
next-door
nice
nice-looking
nicest
nickname
nieces
night
nightmare
nightmares
nine
nine-to-five
nineteen-ninety-seven
ninety
no
nobody
nodded
noise
noises
noisy
nominated
non-native
non-smoking
none
nonsense
nonstop
noodles
noon
nor
normal
normally
north
northern
nose
not
note
notebook
notebooks
noted
notes
nothing
notice
noticeable
noticed
novel
novelist
novels
now
nowadays
nowhere
nuclear
numb
number
numbered
numbers
numerous
nurse
nurses
nuts
o'clock
oars
oath
oatmeal
obese
obey
obeyed
object
objected
objection
obligation
obliged
obscure
observations
observatory
observe
obstinate
obstructs
obtained
obvious
obviously
ocarina
occasional
occasionally
occasions
occupation
occupational
occupied
occur
occurred
ocean
of
off
offended
offensive
offer
offered
office
officers
offices
official
officially
often
oil
okay
old
old-fashioned
older
oldest
olives
on
once
one
one-track
ones
ongoing
onions
online
only
onto
open
opened
opening
operate
operation
operator
opinion
opinions
opportunities
opportunity
opposed
opposite
opposition
optimist
optimistic
or
orange
oranges
orbit
orbits
orchard
order
ordered
orders
ordinary
organ
organic
organizations
organized
original
originally
originated
orphan
ostriches
other
others
otherwise
ought
our
ours
ourselves
out
outdoors
outrank
outside
outskirts
oven
over
overcoat
overcome
overconfident
overdoing
overeat
overhead
overlook
overreacting
overseas
overslept
overtime
overweight
owe
owed
owes
owl
own
owner
owns
oxygen
oysters
ozone
p.m
p.m.
pacemaker
paces
package
page
pages
paid
pain
painful
pains
paint
paintbrush
painted
painter
painting
paintings
pair
pairs
pajamas
pale
palm
palms
pamphlet
pan
pancakes
panel
panic
pants
paper
papers
parachute
parade
paradise
paragraph
parallel
parallels
paranoid
parasol
parcel
pardon
parents
park
parked
parking
parks
parrot
part
part-time
partial
partially
participants
participate
participated
particular
particularly
parties
partners
parts
party
pass
passage
passed
passenger
passengers
passes
passing
passion
passive
passport
password
past
pasta
pastime
pastor
pasture
path
patience
patient
patients
patio
patriotism
patted
pattern
paused
paved
pay
paying
payment
pays
peace
peace-loving
peacefully
peach
peaches
peanuts
pear
peas
peculiar
peel
peg
pen
penalty
pencil
pencils
pendant
pennies
penny
pens
people
pepper
peppers
per
percent
perfect
perfectly
perform
performance
performed
perhaps
period
permanent
permission
permit
permits
permitted
permitting
persecuted
perseverance
person
personal
personality
personally
persuade
persuaded
pessimistic
pessimists
pet
petals
pets
pharmacy
phase
pheasant
phenomenon
philosopher
philosophy
phone
phoned
phones
photo
photogenic
photograph
photographer
photographs
photos
physically
physician
physics
pianist
piano
pick
picked
picking
pickpockets
picks
picky
picnic
picture
pictures
pie
piece
pieces
pies
pig
pigeon-toed
pigeons
pigsty
pillar
pillow
pilot
piloted
pin
pinched
pine
pineapple
pineapples
pink
pint
pipe
pirate
pirates
pitch
pity
pizza
pizzas
place
placed
places
plain
plan
plane
planes
planet
planets
planned
planning
plans
plant
planted
plants
plastered
plastic
plate
plates
platform
play
played
player
players
playfully
playground
playing
plays
pleasant
please
pleased
pleasure
plenty
pliable
pliers
plunged
plus
pocket
pockets
pod
poem
poems
poet
poetry
poets
point
point-blank
pointed
points
poison
poisoner
poisoning
poisonous
poked
poker
poking
polar
police
policeman
policemen
policy
polish
polite
politeness
political
politician
politics
pollen
pollutes
pollution
pond
pool
pools
poor
poorly
pop
popcorn
popular
population
position
positive
possess
possession
possibility
possible
possibly
post
postcard
postcards
poster
posters
postponed
pot
potato
potatoes
pound
pounds
poured
pours
powder
power
practical
practice
practiced
practicing
pragmatic
prairie
prairies
pray
praying
preceding
precious
precise
predict
predicted
predicting
prediction
predictions
prefectures
prefer
preferred
prefers
pregnancy
pregnant
prejudice
prejudiced
premonition
preparations
prepare
prepared
prepares
preparing
prescribed
prescription
presence
present
presented
presents
preserve
presidency
president
press
pressed
pressure
pressured
pretend
pretended
pretending
pretends
pretext
prettier
prettiest
pretty
prevail
prevent
prevented
prevents
previous
prey
price
prices
pride
priest
primary
prime
prince
princess
principal
printed
printer
printers
prison
prisoner
prisoners
privacy
private
privately
privilege
privileges
prize
prized
probably
probe
problem
problems
procedure
procedures
proceed
proceeded
process
procrastinate
procrastinating
produces
product
production
products
profession
professional
professor
proficient
profitable
profits
program
programmer
programs
progress
progressing
prohibited
project
promise
promised
promises
promoted
promotes
pronounce
pronunciation
properly
property
prophecy
proposal
propose
proposed
prosecutor
protect
proud
prove
proved
proven
proverb
provide
provided
prudent
pry
pseudo-science
pub
public
published
pubs
pudding
puffs
pull
pulled
pulling
pulse
pumps
punctual
punctuation
punished
punishes
punishing
punishment
puppet
puppies
puppy
purchase
pure
purpose
purse
pursue
push
pushed
pushing
put
puts
putt
putting
puzzle
puzzled
qualified
quality
qualms
quantities
quantity
quarreling
quarrels
quart
quarter
quarterback
quelled
question
questioned
questions
quick
quickest
quickly
quiet
quietly
quit
quite
quits
quitter
quitting
quiz
quoted
quotes
rabbi
rabbit
rabbits
race
raced
racial
racist
racket
rackets
radiation
radio
radium
raffle
railroad
rain
raincoat
rained
raining
rains
rainy
raise
raised
raising
ran
rang
range
rap
rapid
rapidly
rare
rarely
rat
rate
rates
rather
rats
raw
rays
re-elected
reach
reached
read
reading
reads
ready
real
realise
realistic
realize
realized
really
reap
reason
reasonable
reasons
rebellion
rebuilding
receipt
receive
received
recent
recently
recite
recklessly
recognised
recognition
recognize
recognized
recollection
recommend
reconsider
record
recorded
recorder
records
recover
recovered
recovering
recovery
recyclable
recycling
red
reduce
reduced
reducing
reef
referred
referring
reflection
reform
reformed
reforms
refreshing
refreshments
refrigerator
refugees
refusal
refuse
refused
refuses
regards
region
regions
register
registered
registration
regret
regrets
regular
regularly
rejected
related
relationship
relative
relatively
relatives
relax
relaxed
release
released
relevant
reliable
relief
relies
relieve
relieved
religious
reluctantly
rely
remain
remained
remarkable
remarks
remember
remembered
remembering
remembers
remind
reminded
reminds
remodeled
remorse
remote
remotely
remove
removed
renew
renewed
renovated
rent
rented
repainted
repair
repaired
repairing
repay
repeat
repeated
repeatedly
repeats
replace
replaced
replied
reply
report
reported
reporter
reports
represent
reptiles
republic
reputation
reputed
request
requested
require
required
requirements
requires
reread
rescued
research
resemblance
resembled
resembles
resent
resented
reservation
reserve
reserved
resides
resign
resigned
resigning
resist
resolution
resolutions
resolved
resourceful
resources
respect
respected
respecting
respects
respond
responding
response
responsibilities
responsibility
responsible
rest
restaurant
restaurants
rested
resting
restless
restroom
result
resulted
results
resume
retire
retired
retirement
retiring
retract
retreat
return
returned
returning
returns
revealed
revenge
reverse
reviews
revolution
revolve
reward
ribbon
rice
rich
richer
riches
richest
rid
ride
rides
ridiculous
riding
rifle
right
right-handed
rights
ring
ringing
rings
ringtone
rink
riot
ripped
rise
risen
rises
rising
risk
risked
risks
risky
river
rivers
road
roared
roast
robbed
robber
robbery
robot
rock
rocket
rocks
rode
role
roll
rolled
roller
roller-skate
rollerblades
rolling
rolls
romantic
roof
room
rooms
root
rope
rose
roses
rougher
roughly
round
round-trip
route
row
rowing
rub
rubbish
rude
rudeness
rug
rugby
ruin
ruined
ruins
rule
rules
rumor
rumors
run
rung
runner
running
runs
rush
rushed
rust
s
sack
sacrifice
sad
saddled
sadly
sadness
safe
safely
safer
safety
said
sail
sailed
sailing
sake
salad
salary
sale
sales
salesman
salmon
salt
salted
salty
same
sample
sanctuary
sand
sandwich
sandwiches
sang
sank
sarcastic
sashimi
sat
satellite
satellites
satisfactory
satisfied
satisfy
sauce
sausage
sauté
save
saved
saves
saving
savings
saw
sawing
saxophone
say
saying
says
scales
scandal
scar
scarcely
scare
scared
scarf
scary
scenario
scene
scenery
schedule
scholar
scholarship
school
schools
science
scientific
scientifically
scientist
scientists
scissors
scold
scolded
scolding
score
scored
scores
scraped
scratchy
scream
screaming
screen
screwball
screwed
scumbag
sea
search
searched
searching
seashell
seaside
season
seasoned
seasons
seat
seated
seats
second
secondhand
secret
secretarial
secretary
secretive
secretly
secrets
section
security
see
seeds
seeing
seek
seem
seemed
seems
seen
sees
seized
seldom
selected
self-made
self-service
self-sufficient
selfish
sell
selling
sells
semester
seminar
senator
send
sending
senior
sense
sensible
sensitive
sent
sentence
sentenced
sentences
separate
separated
separately
serial
series
serious
seriously
serpent
servants
serve
served
service
serving
set
sets
settled
settlements
seven
seventeen
seventeenth
seventy
several
severe
severely
sewing
shabby
shadow
shake
shaking
shall
shame
shape
share
shared
shark
sharp
sharp-witted
shattered
shave
shaved
shaver
shaves
shaving
she
shed
sheep
sheer
sheet
sheets
shelf
shell
shelter
shelters
shelves
shift
shine
shining
ship
shipment
ships
shirt
shirtless
shirts
shock
shocked
shoe
shoehorn
shoes
shone
shook
shoot
shooting
shop
shopping
shops
shore
short
short-cut
shortage
shorter
shortest
shot
should
shoulder
shoulders
shouldn't
shout
shouted
shouting
shovel
show
showed
shower
showers
showing
shown
shows
shuffle
shut
shutting
shy
shyly
siblings
sic
sick
sickness
side
sides
sidewalk
sight
sights
sign
signal
signature
signed
significance
signs
silence
silent
silly
silver
similar
simple
simplest
simply
sin
since
sincere
sing
singer
singing
single
sings
sipped
sir
sister
sisters
sit
sits
sitting
situation
six
six-story
six-thirty
sixteen
sixty
size
sizes
skate
skateboards
skates
skating
skeleton
skeptical
sketch
ski
skier
skies
skiing
skill
skilled
skin
skinny
skip
skipped
skirt
skirts
skull
skunk
sky
slamming
slang
slapped
slaughter
slave
slavery
slaves
sleep
sleeping
sleeps
sleepwalking
sleepy
sleeve
sleeves
slept
slice
slight
slightest
slightly
slip
slipped
slippers
slippery
slope
sloppy
sloshed
slow
slowing
slowly
slum
slums
smack
small
smaller
smallest
smallpox
smart
smarter
smartest
smartphone
smashed
smell
smelled
smells
smile
smiled
smiles
smiling
smoke
smoked
smoker
smokes
smoking
smooth
smoothies
smoothly
smuggling
snack
snails
snake
snakes
snare
sneaked
sneeze
sneezing
snickered
snobbish
snored
snow
snow-covered
snowed
snowfall
snowing
snows
so
soap
soared
sobbing
sober
soccer
social
society
sock
socks
soda
sofa
soft
softly
software
soil
solar
sold
soldier
soldiers
sole
solid
solo
solution
solutions
solve
solved
solving
some
somebody
someday
somehow
someone
something
sometime
sometimes
somewhere
son
song
songs
sons
soon
sooner
sore
sorrow
sorry
sort
sorts
soul
souls
sound
sounds
soup
sour
source
south
souvenir
souvenirs
sow
space
span
spare
spared
speak
speaker
speakers
speaking
speaks
spear
special
species
spectacular
speech
speeches
speechless
speed
spell
spelling
spend
spending
spends
spent
spices
spicy
spiders
spilled
spilling
spilt
spinach
spinning
spirits
spite
spitting
split
spoil
spoke
spoken
sponge
spoon
sport
sporting
sports
spot
sprang
spray
spread
spreads
spring
springs
sprinkle
sprinkling
spy
square
squeezed
stab
stabbed
stack
stadium
staff
stage
stained
stains
stairs
stake
stalking
stamp
stamps
stand
standard
standing
stands
stapler
star
stare
staring
stark
stars
start
started
starting
startling
starts
starvation
starved
starving
state
statement
states
statesman
station
statistics
statue
stay
stayed
staying
stays
steadily
steady
steak
steal
stealing
steam
steep
step
stepped
steps
stew
stewardess
stick
stiff
still
sting
stings
stingy
stink
stir
stitch
stock
stockings
stocks
stole
stolen
stomach
stomachache
stone
stood
stop
stopped
stopping
stops
store
stores
stories
stork
storm
stormy
story
stove
stoves
straight
straightforward
strain
strange
stranger
strangers
strategy
stratosphere
strawberries
strawberry
streaked
stream
street
streets
strength
strengths
stress
stressed
stressful
stretched
strict
strictly
strike
string
strings
stripes
stroganoff
strong
stronger
strongly
struck
structure
struggle
struggled
stubborn
stuck
student
students
studied
studies
study
studying
stuff
stung
stunned
stupid
stupidest
style
stylish
subarachnoid
subject
subjects
submitted
subscribe
subscriptions
substituted
subtle
suburbs
subway
succeed
succeeded
succeeding
success
successfully
such
suckers
sudden
suddenly
sue
sued
suffer
suffered
suffering
sugar
suggest
suggested
suggesting
suggestion
suggestions
suicide
suit
suitable
suitcase
suitcases
suited
suits
sulfuric
sum
summer
sun
sunflower
sung
sunglasses
sunny
sunrise
sunscreen
sunset
suntan
superior
supermarket
supper
supplies
supply
support
supported
suppose
supposed
sure
surfboard
surfers
surged
surgeon
surgery
surprise
surprised
surprising
surrender
surrounding
surveillance
survive
survived
survivor
survivors
susceptible
sushi
suspect
suspected
suspicious
suspiciously
swallow
swallowed
swallows
swam
swampy
swarm
swear
swearing
sweat
sweater
sweep
sweeping
sweet
sweetheart
swept
swim
swimmer
swimmers
swimming
swims
swimsuit
swindled
switch
switched
swollen
swore
symbol
sympathy
symptoms
synagogues
synchronize
syringe
syrup
system
t
table
tablecloth
tag
tags
tail
tails
take
taken
takes
taking
talent
talented
talents
talk
talkative
talked
talking
talks
tall
taller
tallest
tampered
tan
tank
tape
tapped
target
task
taste
tasted
tastes
tasty
tattoo
taught
tax
taxed
taxes
taxi
tea
teach
teacher
teachers
teaches
teaching
team
teammates
teams
teapot
tear
tears
teas
teeming
teenager
teenagers
teens
teeth
telegram
telephone
telephoned
telephones
telescope
television
tell
telling
tells
temper
temperate
temperature
temple
