<pad>
<unk>
<sos>
<eos>
 
!
"
$
%
'
(
)
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
?
A
B
C
D
F
H
I
J
K
L
M
N
O
P
S
T
U
V
W
X
[
]
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
r
s
t
w
y
·
ö
“
”
•
　
、
。
《
》
「
」
一
丁
七
万
丈
三
上
下
不
与
丐
丑
专
且
世
丘
业
丛
东
丝
丢
两
严
丧
个
中
丰
串
临
丸
丹
为
主
丽
举
久
么
义
之
乌
乎
乏
乐
乔
乖
乘
乙
九
乞
也
习
乡
书
买
乱
乳
了
予
争
事
二
于
亏
云
互
五
井
亚
些
亡
交
产
亩
享
京
亭
亮
亲
人
亿
什
仁
仅
仆
仇
今
介
仍
从
仑
仔
他
仗
付
仙
代
令
以
仪
们
仰
件
价
任
份
仿
企
伊
伍
伏
伐
休
众
优
伙
会
伞
伟
传
伤
伦
伪
伫
伯
估
伴
伸
似
但
位
低
住
佑
体
何
余
佛
作
你
佣
佩
佳
使
侄
侈
例
侍
供
依
侦
侧
侮
侵
便
促
俄
俊
俗
俚
保
信
俩
俭
修
俱
倍
倒
倔
候
倚
借
倡
倦
债
值
倾
假
偏
做
停
健
偶
偷
偿
傍
储
催
傲
傻
像
僧
僵
儿
允
元
兄
充
兆
先
光
克
免
兑
兔
党
兜
入
全
八
公
六
兰
共
关
兴
兵
其
具
典
兹
养
兼
兽
兿
内
册
再
冒
写
军
农
冠
冥
冬
冰
冲
决
况
冷
冻
净
凄
准
凉
凌
减
凑
几
凡
凤
凭
凯
凰
凳
凶
出
击
函
凿
刀
分
切
刊
刑
划
列
则
刚
创
初
删
判
利
别
刮
到
制
刷
券
刹
刺
刻
剂
剃
削
前
剎
剑
剔
剧
剩
剪
副
劈
力
劝
办
功
加
务
劣
动
助
努
劫
励
劲
劳
势
勇
勒
勤
勺
勾
勿
包
匆
化
北
匙
匠
匪
匮
匹
区
医
匿
十
千
升
午
半
华
协
卑
卓
单
卖
南
博
卜
占
卡
卢
卧
卫
印
危
即
却
卵
卷
厂
厄
厅
历
厉
压
厌
厕
厘
厚
原
厨
去
县
参
又
叉
及
友
双
反
发
叔
取
受
变
叛
叟
叠
口
古
句
另
只
叫
召
叮
可
台
史
右
叶
号
司
吁
吃
各
合
吉
吊
同
名
后
吐
向
吓
吗
君
吝
吞
吟
吠
否
吧
含
听
吭
启
吵
吸
吹
吻
吼
呀
呆
呈
告
呎
员
呢
周
味
呻
呼
命
咀
咄
咆
咋
和
咎
咔
咕
咖
咙
咨
咬
咱
咳
咸
咽
品
哄
哈
响
哑
哒
哟
哥
哦
哨
哩
哪
哭
哮
哲
哺
唇
唐
唔
唤
唬
售
唯
唱
啃
商
啊
啜
啡
啤
啥
啦
啬
啸
喂
善
喉
喊
喔
喘
喜
喝
喱
喷
喻
嗅
嗓
嗜
嗝
嗨
嗯
嗽
嘀
嘘
嘛
嘱
嘲
嘴
嘿
噢
器
噩
噪
噬
嚏
嚼
囓
囚
四
回
因
团
园
困
囱
围
固
国
图
圆
圈
土
圣
在
地
场
圾
址
均
坊
坏
坐
块
坚
坝
坞
坟
坠
坡
坦
坪
垂
垃
垄
型
垒
垠
垫
埃
埋
城
埙
域
培
基
堂
堆
堡
堪
堵
塑
塔
塘
塞
填
境
墓
墙
增
墟
墨
墩
壁
壤
士
壮
声
壳
壶
处
备
复
夏
夕
外
多
夜
够
大
天
太
夫
夭
央
失
头
夷
夸
夹
奇
奉
奋
奏
契
奔
奖
套
奢
奥
女
奴
奶
她
好
如
妆
妇
妈
妒
妙
妥
妨
妳
妹
妻
姆
姊
始
姐
姑
姓
委
姜
姨
姻
姿
威
娃
娘
娶
婆
婉
婚
婪
婴
婶
媛
媳
嫁
嫉
嫌
嫩
子
孑
孔
孕
字
存
孙
季
孤
学
孩
宁
它
宅
宇
守
安
完
官
宙
定
宜
宝
实
宠
审
客
宣
室
宪
宫
害
宴
宵
家
容
宽
宾
宿
寂
寄
密
富
寒
寓
寝
寞
察
寸
对
寺
寻
导
寿
封
射
将
尊
小
少
尔
尖
尘
尚
尝
尤
尬
就
尴
尸
尺
尼
尽
尾
尿
局
屁
层
居
屈
屉
届
屋
屏
屑
展
属
屠
履
屯
山
岁
岔
岛
岩
岸
峭
峰
崖
崩
巅
川
州
巡
巢
工
左
巧
巨
巫
差
己
已
巴
巾
币
市
布
帅
帆
师
希
帐
帕
帖
帘
帝
带
席
帮
常
帽
幅
幌
幕
幚
幢
干
平
年
并
幸
幻
幼
幽
广
庄
庆
庇
床
序
库
应
底
店
庙
府
庞
废
度
座
庭
康
廉
廊
延
廷
建
开
异
弃
弄
弊
式
弓
引
弗
弟
张
弥
弦
弯
弱
弹
强
归
当
录
形
彩
彬
影
役
彻
彼
往
征
径
待
很
律
徒
得
御
循
微
德
心
必
忆
忌
忍
志
忘
忙
忠
忧
快
念
忽
怀
态
怂
怎
怒
怕
怖
怜
思
急
性
怨
怪
怯
总
恋
恐
恒
恕
恢
恤
恨
恩
恭
息
恰
恳
恶
恼
恿
悄
悉
悔
患
悦
您
悬
悲
情
惊
惑
惕
惜
惠
惧
惨
惩
惫
惭
惯
惰
想
惹
愁
愈
愉
意
愚
感
愤
愧
愿
慈
慌
慎
慕
慢
慨
慰
慷
憩
憾
懂
懊
懒
懦
戈
戏
成
我
戒
或
战
戚
截
戳
戴
户
房
所
扇
手
才
扎
扑
扒
打
扔
托
扣
执
扩
扫
扬
扭
扮
扯
扰
扶
批
找
承
技
抄
把
抑
抓
投
抖
抗
折
抚
抛
抢
护
报
抨
披
抬
抱
抵
抽
拄
担
拆
拉
拌
拍
拐
拒
拔
拖
招
拜
拣
拥
拧
拨
择
括
拭
拯
拳
拷
拼
拽
拾
拿
持
挂
指
按
挑
挖
挚
挟
挡
挣
挤
挥
挨
挪
振
挺
挽
捂
捉
捏
捐
捕
捞
损
捡
换
据
捷
授
掉
掌
掏
排
探
接
控
推
掩
措
掴
描
提
插
握
揭
援
搁
搅
搏
搓
搜
搞
搬
搭
携
摄
摆
摇
摔
摘
摧
摩
摸
撇
撑
撒
撕
撞
撤
播
撼
擅
操
擎
擦
攀
攒
支
收
改
攻
放
政
故
效
敌
敏
救
教
敢
散
敦
敬
数
敲
整
文
斑
斗
料
斜
斤
斥
断
斯
新
方
施
旁
旅
族
旗
无
既
日
旦
旧
早
旬
时
旺
昂
明
昏
易
昔
星
映
春
昨
是
昰
昵
显
晃
晋
晒
晓
晕
晚
晤
晨
普
景
晰
晴
智
晾
暂
暇
暑
暖
暗
暴
曲
更
曼
曾
替
最
月
有
朋
服
朗
望
朝
期
木
未
末
本
术
朱
朵
机
杀
杂
权
杆
杉
李
材
村
杖
杜
束
杠
条
来
杯
杰
松
板
极
构
析
枕
林
枚
果
枝
枪
枯
架
柏
某
染
柔
柜
柠
查
柯
柱
柳
柴
柿
栅
标
栋
栏
树
栖
校
样
核
根
格
桃
案
桌
桑
档
桥
桦
桨
桩
桶
梅
梦
梨
梯
械
梳
梵
检
棉
棋
棍
棒
棕
棚
森
棵
椅
植
椒
椭
楚
楼
概
榄
榔
榜
榨
槟
模
横
樱
樵
樽
橄
橘
橙
橡
橱
檬
欠
次
欢
欣
欧
欲
欺
款
歇
歉
歌
止
正
此
步
武
歧
死
殃
殊
残
殖
殴
段
毁
毅
母
每
毒
比
毕
毙
毛
毫
毯
氏
民
氓
气
氛
氧
氨
水
永
汁
求
汇
汉
汗
江
池
污
汤
汽
沉
沏
沐
沙
沟
没
沮
河
沸
油
治
沼
沾
沿
泄
泉
泊
法
泛
泡
波
泣
泥
注
泪
泰
泳
泻
泼
泽
洁
洋
洒
洗
洛
洞
津
洪
洲
活
洽
派
流
浅
浆
浇
测
济
浏
浑
浓
浩
浪
浮
浴
海
浸
涂
消
涉
涌
润
涨
涩
液
淇
淋
淡
深
混
淹
添
清
渐
渔
渡
温
港
渴
游
湖
湾
湿
溅
源
溜
溢
溪
溯
溺
滋
滑
滚
滞
满
滥
滨
滩
滴
漂
漆
漏
演
漠
漫
潜
潢
潦
潮
潺
澄
澡
澳
激
濒
瀑
瀚
灌
火
灭
灯
灰
灵
灾
炉
炎
炒
炖
炭
炸
点
炼
烁
烂
烈
烊
烘
烛
烟
烤
烦
烧
烫
烬
热
烹
焉
焦
焰
然
煎
煤
照
煮
熄
熊
熏
熟
熨
熬
燃
燕
爆
爬
爱
爵
父
爷
爸
爹
爽
片
版
牌
牙
牛
牡
牢
牧
物
牲
牵
特
牺
犬
犯
状
犹
狂
狐
狗
狠
狡
狩
独
狮
狱
狸
狼
猎
猛
猜
猪
猫
献
猴
率
玉
王
玛
玩
玫
环
现
玻
珊
珍
珠
班
球
理
琴
琵
琶
瑚
瑞
瑰
璃
瓜
瓣
瓦
瓶
甘
甚
甜
生
甥
用
甩
田
由
甲
申
电
男
画
畅
界
畏
留
略
番
疏
疑
疗
疚
疤
疫
疯
疲
疼
疾
病
症
痊
痒
痕
痛
痰
痴
瘦
瘪
瘾
癌
登
白
百
皂
的
皆
皇
皮
皱
盆
盈
益
盏
盐
监
盒
盔
盖
盗
盘
盛
盟
目
盯
盲
直
相
盹
盼
省
眉
看
真
眠
眨
眼
着
睁
睛
睡
督
睹
瞌
瞎
瞒
瞟
瞥
瞧
瞪
瞬
瞭
矛
矣
知
矩
短
矮
石
矶
矿
码
砍
砒
研
砰
破
砸
础
硕
硫
硬
确
碌
碍
碎
碑
碗
碟
碰
碳
碾
磁
磅
磨
礁
示
礼
社
祈
祖
祝
神
祟
票
祷
祸
禁
福
离
秀
私
秃
秋
种
科
秘
租
积
称
移
稀
程
稍
税
稔
稚
稠
稣
稳
稻
稿
穆
穴
究
穷
空
穿
突
窃
窄
窍
窗
窝
窟
立
站
竞
竟
章
童
竭
端
竹
笆
笋
笑
笔
符
笨
第
笼
等
筋
筑
筒
答
策
筝
筵
筷
筹
签
简
算
管
箭
箱
篇
篮
篱
篷
簿
籍
米
类
粉
粗
粘
粮
精
糊
糕
糖
糙
糟
系
素
索
紧
紫
累
絶
繁
纔
纠
红
约
级
纪
纫
纯
纳
纵
纸
纹
纺
纽
线
练
组
绅
细
织
终
绊
绍
经
绑
结
绕
绘
给
络
绝
统
继
绩
绪
续
绳
维
绵
绷
绸
绽
绿
缉
缓
编
缘
缝
缠
缩
缪
缴
缸
缺
罐
网
罔
罕
罗
罚
罢
罪
置
署
羊
美
羞
羡
群
羽
翁
翅
翔
翘
翰
翻
翼
耀
老
考
者
而
耍
耐
耕
耗
耘
耳
耶
耻
耽
聊
聋
职
联
聘
聚
聪
肃
肉
肌
肘
肚
肝
肠
股
肤
肥
肩
肪
肯
育
肴
肺
肿
胀
胁
胃
胆
背
胎
胖
胜
胞
胡
胳
胶
胸
能
脂
脆
脉
脏
脑
脖
脚
脱
脸
脾
腆
腊
腋
腐
腮
腰
腺
腻
腼
腾
腿
膀
膊
膏
膜
膝
膨
膳
臂
臊
自
臭
至
致
舅
舌
舍
舒
舔
舞
舟
航
般
船
艇
艘
良
艰
色
艺
艾
节
芋
芙
芝
芦
芬
花
芽
苍
苏
苔
苗
若
苦
英
苹
范
茄
茅
茕
茫
茵
茶
草
荐
荒
荡
荣
荧
药
荷
莉
莎
莓
莫
莱
获
莽
菜
菠
菲
萃
萄
萌
萎
萝
营
萧
萨
落
著
葛
葡
董
葫
葬
葱
葵
蒙
蒜
蒸
蓄
蓝
蓬
蔬
蔼
蔽
蕉
蕾
薄
薪
薯
藉
藏
虎
虐
虑
虚
虫
虹
虽
虾
蚀
蚁
蚊
蚤
蛀
蛇
蛋
蛎
蛙
蛛
蛰
蜂
蜍
蜒
蜗
蜘
蜜
蜡
蜿
蝇
蝙
蝠
蝴
蝶
螂
融
螫
蟀
蟋
蟑
蟾
蠢
血
行
衕
街
衡
衣
补
表
衫
衬
衰
衷
袋
袖
袜
袤
被
袭
裁
裂
装
裕
裙
裤
裸
裹
褐
褒
西
要
覆
覚
见
观
规
视
览
觉
角
解
触
言
誉
誓
警
计
订
认
讨
让
训
议
讯
记
讲
讶
许
论
设
访
证
评
识
诉
诊
诋
词
译
试
诗
诚
话
诞
诡
询
该
详
语
误
诱
说
诵
请
诸
诺
读
课
谁
调
谅
谈
谊
谋
谍
谎
谐
谓
谚
谜
谢
谣
谦
谧
谨
谬
谱
谴
谷
豆
豚
象
豪
豫
貌
贝
负
贡
财
责
败
账
货
质
贩
贪
贫
贬
购
贯
贴
贵
贷
贸
费
贺
贼
贿
赂
资
赋
赌
赏
赐
赔
赖
赚
赛
赝
赞
赠
赢
赤
走
赴
赶
起
趁
超
越
趋
趟
趣
足
趴
趾
跃
跌
跑
距
跟
跤
跨
路
跳
践
踏
踝
踢
踩
踪
踮
蹈
蹑
蹭
躁
身
躲
躺
车
轨
转
轮
软
轰
轻
载
较
辆
辈
辍
辑
输
辕
辗
辘
辙
辛
辜
辞
辣
辨
辩
辰
辱
边
达
迁
迄
迅
过
迎
运
近
返
还
这
进
远
违
连
迟
迪
迫
述
迷
迹
追
退
送
适
逃
逆
选
逊
透
逐
递
途
逗
通
逛
逝
速
造
逢
逮
逸
逹
逻
逼
遅
遇
遍
遏
道
遗
遛
遣
遥
遭
遮
遵
避
邀
那
邮
邻
郁
郊
郎
部
都
鄙
配
酒
酣
酪
酬
酱
酷
酸
醇
醉
醒
醺
采
释
里
重
野
量
金
鉴
针
钉
钓
钞
钟
钢
钥
钩
钮
钱
钳
钻
铁
铃
铅
铐
铲
银
铺
链
销
锁
锅
锈
锋
锐
锕
错
锡
锤
键
锯
锻
镇
镑
镖
镜
镭
镶
长
门
闪
闭
问
闯
闲
间
闷
闹
闻
阁
阅
阖
队
阪
阱
防
阳
阴
阵
阶
阻
阿
附
际
陆
陈
陋
陌
降
限
陡
院
除
险
陪
陵
陶
陷
随
隐
隔
障
隶
难
雀
雄
雅
集
雇
雕
雨
雪
零
雷
雾
需
震
霉
霍
霜
露
霸
青
靓
静
非
靠
面
革
靴
靶
鞋
韧
韩
音
页
顶
项
顺
须
顽
顾
顿
颁
预
领
颇
颊
频
颗
题
颜
额
颤
风
飞
食
餐
饥
饪
饭
饮
饰
饱
饵
饶
饼
饿
馅
馆
首
香
馨
马
驯
驱
驳
驶
驻
驾
骂
骄
验
骏
骑
骗
骡
骨
骸
高
髦
髪
鬼
魁
魂
魅
魔
鱼
鲁
鲑
鲜
鲤
鲨
鲱
鲸
鳟
鸟
鸡
鸦
鸫
鸵
鸽
鹉
鹤
鹦
鹭
鹰
鹳
鹿
麦
麻
黄
黎
黏
黑
默
鼓
鼠
鼬
鼻
鼾
齐
齿
龄
龈
龙
龟
﹐
！
＂
％
（
）
，
－
：
？
